#include <stdio.h>

int main() {
   int n, m, i;

   // Внеси го степенот на првиот полином
   printf("Внеси го степенот на првиот полином: ");
   scanf("%d", &n);

   // Внеси ги коефициентите на првиот полином
   int a[n+1];
   printf("Внеси ги коефициентите на првиот полином: ");
   for (i = 0; i <= n; i++) {
      scanf("%d", &a[i]);
   }

   // Внеси го степенот на вториот полином
   printf("Внеси го степенот на вториот полином: ");
   scanf("%d", &m);

   // Внеси ги коефициентите на вториот полином
   int b[m+1];
   printf("Внеси ги коефициентите на вториот полином: ");
   for (i = 0; i <= m; i++) {
      scanf("%d", &b[i]);
   }

   // Збир на полиномите
   int s[max(n,m)+1];
   for (i = 0; i <= max(n,m); i++) {
      if (i <= n && i <= m) {
         s[i] = a[i] + b[i];
      } else if (i <= n) {
         s[i] = a[i];
      } else {
         s[i] = b[i];
      }
   }

   // Испечати го збирот
   printf("Збирот на двете полиноми е: ");
   for (i = max(n,m); i >= 0; i--) {
      printf("%d ", s[i]);
   }
   printf("\n");

   return 0;
}
